<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"e2cdb9dc47d8de44ce2477b7b72996ac2146b102030e31d896c19de98d8a382e","plan_job_ref":"Job Test actions using target and replace #465 at https://github.com/dflook/terraform-github-actions/actions/runs/13911101073","plan_out_hash":"d8fa2f148f6d291a1555392e988bee94a728a8a133d4bd45beb2c10707928c95","plan_hash":"14a577941246f527fe8ccef780f5b7e80435a6af2485906fbd95a2e3a4cf6c6d","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "nT56QlEw4K" -> (known after apply)
!~  foreach = "hkwh1NKPXz" -> (known after apply)
```
</details>

:memo: Plan generated in [Test actions using target and replace #465](https://github.com/dflook/terraform-github-actions/actions/runs/13911101073)